as21253679/nrf51822/ble_app_uart_3adc_eeprom_button_8bit2_recieve/main.c
	while (NRF_ADC->EVENTS_END == 0 || times >200 )
    {
		times ++ ;
	}     
	if(times > 200)
	{
		return 0;
	}
	else
	{
		NRF_ADC->EVENTS_END     = 0;
		adc_result              = NRF_ADC->RESULT;
		NRF_ADC->TASKS_STOP     = 1;
	}
    return adc_result;   
}

void get_battery_value()
{
	int battery_value=0;
	uint8_t c[2];
	c[0]=0xFD;
	
	battery_value=adc_start(7);//manually trigger adc
	if(battery_value>=0 && battery_value<=50)			//0%~25%
		c[1]=0x10;
	else if(battery_value>=50 && battery_value<100)		//25%~50%
		c[1]=0x11;
	else if(battery_value>=100 && battery_value<150)	//50%~75%
		c[1]=0x12;
	else if(battery_value>=150)							//75%~100%
		c[1]=0x13;
	
	ble_nus_string_send(&m_nus, c, 2);//send data through ble uart
	nrf_delay_ms(20);
}

void update_device_status()
{
	uint8_t c[2];
	c[0]=0xFD;
	
	if(bt_count==0)				//standby mode
		c[1]=0x00;
	else if(bt_count==1)		//write mode
		c[1]=0x01;
	else if(bt_count==2)		//read mode
		c[1]=0x02;
	
	ble_nus_string_send(&m_nus,c, 2);//send data through ble uart
	nrf_delay_ms(20);
}

/**
 * @brief set adc_pin nopull input. 
 */
static void adc_pin_config(void)
{
	nrf_gpio_cfg_input(4, NRF_GPIO_PIN_NOPULL);
	nrf_gpio_cfg_input(5, NRF_GPIO_PIN_NOPULL);
	nrf_gpio_cfg_input(6, NRF_GPIO_PIN_NOPULL);
}

/**
 * @brief Function button change active mode.
 */
void button_active(void)
{
	int keep_bt_count=0;

	if(nrf_gpio_pin_read(BUTTON_INPUT))
	{
		nrf_gpio_pin_clear(write_led_pin);
		nrf_gpio_pin_clear(read_led_pin);
		
		while(nrf_gpio_pin_read(BUTTON_INPUT))
		{
			keep_bt_count++;
			nrf_delay_ms(1);
			if(keep_bt_count>3000)
				nrf_gpio_pin_set(read_led_pin);
		}
		
		if(keep_bt_count>3000)
		{
			bt_count=2;
			nrf_gpio_pin_set(read_led_pin);
		}
		else
		{
			bt_count=1;
			nrf_gpio_pin_set(write_led_pin);
		}
	}
}

void led_gpio_init(void)
{
	nrf_gpio_cfg_output(write_led_pin);//write mode led
	//nrf_gpio_cfg_output(read_led_pin);//read mode led
	
	nrf_gpio_pin_clear(write_led_pin);
	nrf_gpio_pin_clear(read_led_pin);
}

void write_mode(void)
{
	uint8_t adc_string[50]="";
	uint8_t adc1,adc2,adc3;
	uint8_t reg_byte_H=0x00,reg_byte_L=0x00;
	bool max_bit=false;
	int c=0;
	
	while(1)//wait UV_value is detected
	{
		c++;
		if(c==50)
		{
			nrf_gpio_pin_set(write_led_pin);
		}
		else if(c==100)
		{
			c=0;
			nrf_gpio_pin_clear(write_led_pin);
		}
			
		if(nrf_gpio_pin_read(BUTTON_INPUT) || bt_count!=1)
		{
			nrf_gpio_pin_clear(write_led_pin);
			return;
		}
		
		adc3=adc_start(7);//manually trigger adc
		if(adc3>=50)
		{
			nrf_gpio_pin_set(write_led_pin);
			break;
		}
		power_manage();
		nrf_delay_ms(10);
	}
	
	max_bit=false;reg_byte_H=0x00;reg_byte_L=0x00;
	while(1)
	{
		if(nrf_gpio_pin_read(BUTTON_INPUT) || bt_count!=1)
		{
			nrf_gpio_pin_clear(write_led_pin);
			return;
		}
		
		adc1=adc_start(5);//manually trigger adc
		adc2=adc_start(6);//manually trigger adc
		adc3=adc_start(7);//manually trigger adc
		
		if(adc1>=0xFD)
			adc1=0xFC;
		if(adc2>=0xFD)
			adc2=0xFC;
		if(adc3>=0xFD)
			adc3=0xFC;
		
		write_EEPROM_data(reg_byte_H,reg_byte_L,adc1,adc2,adc3,max_bit);//write data to eeprom
		nrf_delay_ms(9);//I2C delay 10ms
		
		if(reg_byte_L==0xFC)
		{
			if(reg_byte_H==0xFF)
			{
				if(max_bit==true)
					break;
				max_bit=true;
				reg_byte_H=0x00;
				reg_byte_L=0x00;
			}
			else
			{
				reg_byte_H+=0x01;
				reg_byte_L=0x00;
			}
		}
		else
		{
			reg_byte_L+=0x03;
		}
		
		/*printf("ADC5:%d %X\r\n",adc1,adc1);
		printf("ADC6:%d %X\r\n",adc2,adc2);
		printf("ADC7:%d %X\r\n",adc3,adc3);
		printf("\r\n");
		
		ble_nus_string_send(&m_nus, adc_string, 20);//send data through ble uart
		nrf_delay_ms(500);*/
    }
	bt_count=0;
	nrf_gpio_pin_clear(write_led_pin);
}

void read_mode(void)
{
	int i;
	uint8_t reg_byte_H=0x00;
	bool max_bit=false;
	uint8_t m_data[256]; //Buffer for read EEPROM data. 
	uint8_t m_flag[1];
	
	max_bit=false;reg_byte_H=0x00;
	
	nrf_gpio_pin_set(read_led_pin);
	nrf_delay_ms(1000);
	m_flag[0]=0xFD;
	ble_nus_string_send(&m_nus,m_flag, 1);//send data through ble uart
	nrf_delay_ms(100);
	
	
	//test miss package
	for(i=0;i<252;i++)
		m_data[i]=i;
	while(1)
	{
		if(nrf_gpio_pin_read(BUTTON_INPUT) || bt_count!=2)
		{
			nrf_gpio_pin_clear(read_led_pin);
			return;
		}
		
		for(i=0;i<14;i++)//send eeprom_data, max_size of ble_send_data is 20byte
		{
			ble_nus_string_send(&m_nus, &m_data[i*18], 18);//send data through ble uart
			nrf_delay_ms(20);
		}
		if(reg_byte_H==0xFF)//upper_counter for eeprom_address
		{
			if(max_bit==true)
				break;
			max_bit=true;
			reg_byte_H=0x00;
		}
		else
		{
			reg_byte_H+=0x01;
		}
	}
	
	/*while(1)
	{
		if(nrf_gpio_pin_read(BUTTON_INPUT) || bt_count!2)
		{
			nrf_gpio_pin_clear(read_led_pin);
			return;
		}
		
		read_EEPROM_data(reg_byte_H,0x00,max_bit,m_data);//read eeprom data in specific register
		for(i=0;i<15;i++)//send eeprom_data, max_size of ble_send_data is 20byte 
		{
			if(i==14)
				ble_nus_string_send(&m_nus, &m_data[i*18], 3);//send data through ble uart
			else
				ble_nus_string_send(&m_nus, &m_data[i*18], 18);//send data through ble uart
			nrf_delay_ms(20);
		}
		if(reg_byte_H==0xFF)//upper_counter for eeprom_address
		{
			if(max_bit==true)
				break;
			max_bit=true;
			reg_byte_H=0x00;
		}
		else
		{
			reg_byte_H+=0x01;
		}
	}*/
	nrf_delay_ms(1000);
	m_flag[0]=0xFE;
	ble_nus_string_send(&m_nus,m_flag, 1);//send data through ble uart
	nrf_delay_ms(100);
	bt_count=0;
	nrf_gpio_pin_clear(read_led_pin);
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
	led_gpio_init();//led_pin config
	adc_pin_config();//adc_pin config
	nrf_gpio_cfg_input(BUTTON_INPUT,GPIO_PIN_CNF_PULL_Pulldown);
	
	// eeprom init
	twi_init();//i2c init
	
    // Initialize ble.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    //uart_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    //printf("\r\nUART Start!\r\n");

    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

	int xx=0;
	while(1)
	{
		button_active();
		switch(bt_count)
		{
			case 0:
				//printf("\r\nStandby mode\r\n");
				update_device_status();
				power_manage();//low power state
				if(xx>10)
					nrf_gpio_pin_set(write_led_pin);
				if(xx>20)
				{
					nrf_gpio_pin_clear(write_led_pin);
					xx=0;
				}
				xx++;
				break;
			case 1:
				//printf("\r\nWrite mode\r\n");
				update_device_status();
				write_mode();
				break;
			case 2:
				//printf("\r\nRead mode\r\n");
				update_device_status();
				read_mode();
				break;
			case 3:
				bt_count=1;
				break;
		}
		nrf_delay_ms(100);
	}
}
